# Taps
tap "homebrew/cask"
tap "felixkratz/formulae"

# Binaries
brew "btop"
brew "cmatrix"
brew "git"
brew "mackup"
brew "make"
brew "pyenv"
brew "pyright"
brew "ripgrep"
brew "sketchybar"
brew "zoxide"

# nvim
brew "neovim"
brew "fd"
brew "gcc"
brew "tree-sitter"
brew "unzip"

# Apps
cask "aerospace"
cask "discord"
cask "ghostty"
cask "linearmouse"
cask "obsidian"
cask "signal"
cask "visual-studio-code"
cask "zen-browser"

# Menu Bar
cask "hiddenbar"

# Fonts
cask "font-hack-nerd-font"
