# Taps
tap "felixkratz/formulae"

# Binaries
brew "btop"
brew "cmatrix"
brew "git"
brew "mackup"
brew "make"
brew "pyenv"
brew "pyright"
brew "ripgrep"
brew "sketchybar"
brew "starship"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-fast-syntax-highlighting"

# nvim
brew "neovim"
brew "fd"
brew "gcc"
brew "fzf"
brew "lazygit"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "unzip"

# Apps
cask "aerospace"
cask "discord"
cask "ghostty"
cask "linearmouse"
cask "obsidian"
cask "visual-studio-code"
cask "zen"

# Menu Bar
# cask "hiddenbar"

# Fonts
cask "font-hack-nerd-font"
